# начну с теории попробую для всех задач писать немного теории чтобы потом вспомнить про что код
# + подготовиться к зачету, объясняя еще раз себе идею и если будет ручная проверка посмотреть что я вообще делаю
# идея: хотим смотреть на связь между (неформально) катеогорией и ее значением, так зная условно что связь сильная можем неплохо прогнозировать
# базовый пример который приходит в голову смотреть на таблицу по типу:Сотрудник|X (Отдел)|Y (Зарплата)  и хотим посмотреть сильно ли связаны признаки
# и тут связь скорее всего будет большая, а вот если бы вместо отдела смотрели бы на что-то типа веса то все бы было грусто
# Как будем считать связь, просто фиксируем X и смотрим на распред Y только для этой категории, ну а дальше просто считаем дисперсию по Y внутри нее, как раз получим условную дисперсию:
# D(Y∣X=x)= 1/(число объектов в этой категории) * Sum(yi - y_среднее)^2
# потом считаем матожидание по всем таким дисперсиям и сравниваем с обычной дисперсией
# и еслии у нас сильное влияние, у нас есть хорошая группировка по катнгориям,и логично что внутри одной категории диспрерсия будет меньше,
# ну и если среднее дисперсий по всем катеогориям тоже дает меньшее значение чем обычная, значет это закономерность а не какая-то сильная связь в какой-то редкой категории
# для реализации чтобы легко считать условной дисперсии просто будем хранить словарь где для каждой катеогории храним значения
from collections import defaultdict
k = int(input())
n = int(input())
kategory_vals = defaultdict(list)
for i in range(n):
    kategory,val = (map(int, input().split()))
    kategory_vals[kategory].append(val)
ans = 0
for kategory, val_list in kategory_vals.items():
    disp = 0
    for val in val_list:
        disp += (val - sum(val_list)/ len(val_list))**2
    disp /= len(val_list)
    p_i = len(val_list)/ n
    ans += p_i * disp
print(ans)